Revit 2026 API

# ItemFactoryBaseNewModelCurve Method

---

Creates a new model line element.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelCurve NewModelCurve(
	Curve geometryCurve,
	SketchPlane sketchPlane
)
```
```vb
Public Function NewModelCurve (
	geometryCurve As Curve,
	sketchPlane As SketchPlane
) As ModelCurve
```
```cpp
public:
ModelCurve^ NewModelCurve(
	Curve^ geometryCurve,
	SketchPlane^ sketchPlane
)
```
```fsharp
member NewModelCurve :
        geometryCurve : Curve *
        sketchPlane : SketchPlane -> ModelCurve
```

#### Parameters

geometryCurve Curve
     The internal geometry curve for model line.
sketchPlane SketchPlane
    The sketch plane this new model line resides in.

#### Return Value

ModelCurve If successful a new model line element. Otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when curve is not in the plane |

Different type of model curve element will be returned according to the type of geometry curve.

#### Reference

ItemFactoryBase Class

Autodesk.Revit.Creation Namespace